
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.settings_all["atc-router"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"384320ba4f2d4d967d7e7ad085d0f4d76190a91951102094bcc891674523a22e\"" -> "W/\"358a2eb2625686d8381278e9835f1862d693950f0216de74897d50eec57af351\""
        id                          = "atc-router"
        name                        = "atc-router"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-development"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"b468e91099c5511dc56f63368d7cc2dc60fc5bd938d8b5059378633216fe8e17\"" -> "W/\"0aedec15097ee2d0ddeff630a96d2595b2e85b3084d16b6df135570ff7e93029\""
        id                          = "kong-development"
        name                        = "kong-development"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-package"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"773ec3cd22dbc66684e875b26f6965ee6ccdd12688a53dd773cf65800d43bc4c\"" -> "W/\"5e2601af8b45d7f6333b94549158d9f2963f896d7e18f8e75791c8d57ff4b573\""
        id                          = "kong-package"
        name                        = "kong-package"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["multi-arch-fpm"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"9a4dec0f1b1a28230edd39ab10b7983356242fe8b6245d6a67f97e39943de99e\"" -> "W/\"03380334cb479cae724290f7cc771b0e66cf607c6402d10906413b2ab019cf80\""
        id                          = "multi-arch-fpm"
        name                        = "multi-arch-fpm"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"7bcc7117625ce1cffa8b62a092d546dc3d27cdce4b9ba8d3b6815c013580873c\"" -> "W/\"ddb76b5a03f90e7a902b9db25bf0209c7d4f83a955e46e6b9bdb97cb7a0443fc\""
        id          = "1393928"
        name        = "protect-main-branch-kong-build-images-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"6b85d0de73eb50f8ff410738be61e5808e530f8676a79b90861d21f73313d984\"" -> "W/\"709312c09a8c10c18471c31b72072d711d0264ced7fe957809ba6b9aef2e5cee\""
        id          = "1393927"
        name        = "protect-main-branch-kong-openssl-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"e1ce440a95951fff3f3e9a3c1bc788b2877340cfa6812ea0b9f03164b2e744ce\"" -> "W/\"3cdf1576914ac12f84fb8aef28c5ae97e3604a841bcad28c3718a50f8bdf8aef\""
        id          = "1393918"
        name        = "protect-main-branch-kong-runtime-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"eb345fa132a72bcc3b35452b20d82c33e5332972b84de744b4b266964c0723ce\"" -> "W/\"a94d75cb3215f2f2e741237a5d286fdcd1dd0e2ce75f8052fb0f2ccfd63ce13a\""
        id          = "1393934"
        name        = "protect-main-branch-template-1-github-release-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"4da2d37e81542ceedec9a5ff3863e0c2115438118d6375384431dfb665b427b5\"" -> "W/\"b39d027a84a2fbc9b635340b322c3e833e0228c8b744fa27b3b161e7eba982a7\""
        id          = "1393937"
        name        = "protect-main-branch-template-1-terraform-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"f9fcfd7c6f964b7e17a64483f66e74b6ea4eb3ea17103834d477cdd202992c87\"" -> "W/\"1c9b20e9227bc2810cf80144ec75aec12d281a84963ecef8f30ac403a47dd0aa\""
        id          = "1393936"
        name        = "protect-main-branch-template-template-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"3fc4d43fc6407e7779b650caf1b3c30ea09c074ac1a716e5639f3bf5527cab77\"" -> "W/\"743d9d9724b608797e9f8f21a411adedd617f788e1159f199370640b1aa3b531\""
        id          = "1393924"
        name        = "protect-main-branch-kong-build-images-release"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"a9fd12678506182c32dcbc0202c76ec68f867f9f0be4c51de1234c570d8e5568\"" -> "W/\"c0175a3c380d58b034df0283a2698d8461c9a1f9b49afaf6212ff572ef7068b7\""
        id          = "1393925"
        name        = "protect-main-branch-kong-openssl-release"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"b451280c7082f47229d8c13ff290e0952c3b0d5bf6a0136e894cca5a13c65698\"" -> "W/\"95c3d7c3a725553157dac7dfae580a9b034d716859ab94a08a3877c0306d9cba\""
        id          = "1393916"
        name        = "protect-main-branch-kong-runtime-release"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"0fc644846f1d7e77977ac4e230a648ac00568c46955c2b79ad445e3d496da66f\"" -> "W/\"91f7f9b5f548cd8ec786d60bcb2f5f0ed1abee726bef50fa879a658ad398acee\""
        id          = "1393933"
        name        = "protect-main-branch-template-1-terraform-terraform-plan"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # github_repository.settings_all["atc-router"] will be destroyed
  # (because github_repository.settings_all is not in configuration)
  - resource "github_repository" "settings_all" {
      - allow_auto_merge            = true -> null
      - allow_merge_commit          = false -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - etag                        = "W/\"358a2eb2625686d8381278e9835f1862d693950f0216de74897d50eec57af351\"" -> null
      - full_name                   = "gh-org-template/atc-router" -> null
      - git_clone_url               = "git://github.com/gh-org-template/atc-router.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/gh-org-template/atc-router" -> null
      - http_clone_url              = "https://github.com/gh-org-template/atc-router.git" -> null
      - id                          = "atc-router" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "atc-router" -> null
      - node_id                     = "R_kgDOMkDhMg" -> null
      - primary_language            = "Makefile" -> null
      - private                     = false -> null
      - repo_id                     = 843112754 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:gh-org-template/atc-router.git" -> null
      - svn_url                     = "https://github.com/gh-org-template/atc-router" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null

      - security_and_analysis {

          - secret_scanning {
              - status = "disabled" -> null
            }

          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }

      - template {
          - include_all_branches = false -> null
          - owner                = "gh-org-template" -> null
          - repository           = "template-1-github-release" -> null
        }
    }

  # github_repository.settings_all["kong-development"] will be destroyed
  # (because github_repository.settings_all is not in configuration)
  - resource "github_repository" "settings_all" {
      - allow_auto_merge            = true -> null
      - allow_merge_commit          = false -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - etag                        = "W/\"0aedec15097ee2d0ddeff630a96d2595b2e85b3084d16b6df135570ff7e93029\"" -> null
      - full_name                   = "gh-org-template/kong-development" -> null
      - git_clone_url               = "git://github.com/gh-org-template/kong-development.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/gh-org-template/kong-development" -> null
      - http_clone_url              = "https://github.com/gh-org-template/kong-development.git" -> null
      - id                          = "kong-development" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "kong-development" -> null
      - node_id                     = "R_kgDOMkDhQQ" -> null
      - primary_language            = "Shell" -> null
      - private                     = false -> null
      - repo_id                     = 843112769 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:gh-org-template/kong-development.git" -> null
      - svn_url                     = "https://github.com/gh-org-template/kong-development" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null

      - security_and_analysis {

          - secret_scanning {
              - status = "disabled" -> null
            }

          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }

      - template {
          - include_all_branches = false -> null
          - owner                = "gh-org-template" -> null
          - repository           = "template-1-github-release" -> null
        }
    }

  # github_repository.settings_all["kong-package"] will be destroyed
  # (because github_repository.settings_all is not in configuration)
  - resource "github_repository" "settings_all" {
      - allow_auto_merge            = true -> null
      - allow_merge_commit          = false -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - etag                        = "W/\"5e2601af8b45d7f6333b94549158d9f2963f896d7e18f8e75791c8d57ff4b573\"" -> null
      - full_name                   = "gh-org-template/kong-package" -> null
      - git_clone_url               = "git://github.com/gh-org-template/kong-package.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/gh-org-template/kong-package" -> null
      - http_clone_url              = "https://github.com/gh-org-template/kong-package.git" -> null
      - id                          = "kong-package" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "kong-package" -> null
      - node_id                     = "R_kgDOMkDhVQ" -> null
      - primary_language            = "Shell" -> null
      - private                     = false -> null
      - repo_id                     = 843112789 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:gh-org-template/kong-package.git" -> null
      - svn_url                     = "https://github.com/gh-org-template/kong-package" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null

      - security_and_analysis {

          - secret_scanning {
              - status = "disabled" -> null
            }

          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }

      - template {
          - include_all_branches = false -> null
          - owner                = "gh-org-template" -> null
          - repository           = "template-1-github-release" -> null
        }
    }

  # github_repository.settings_all["multi-arch-fpm"] will be destroyed
  # (because github_repository.settings_all is not in configuration)
  - resource "github_repository" "settings_all" {
      - allow_auto_merge            = true -> null
      - allow_merge_commit          = false -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - etag                        = "W/\"03380334cb479cae724290f7cc771b0e66cf607c6402d10906413b2ab019cf80\"" -> null
      - full_name                   = "gh-org-template/multi-arch-fpm" -> null
      - git_clone_url               = "git://github.com/gh-org-template/multi-arch-fpm.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/gh-org-template/multi-arch-fpm" -> null
      - http_clone_url              = "https://github.com/gh-org-template/multi-arch-fpm.git" -> null
      - id                          = "multi-arch-fpm" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "multi-arch-fpm" -> null
      - node_id                     = "R_kgDOMkDhEw" -> null
      - primary_language            = "Makefile" -> null
      - private                     = false -> null
      - repo_id                     = 843112723 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:gh-org-template/multi-arch-fpm.git" -> null
      - svn_url                     = "https://github.com/gh-org-template/multi-arch-fpm" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null

      - security_and_analysis {

          - secret_scanning {
              - status = "disabled" -> null
            }

          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }

      - template {
          - include_all_branches = false -> null
          - owner                = "gh-org-template" -> null
          - repository           = "template-1-github-release" -> null
        }
    }

  # github_repository_ruleset.pr_ruleset_all["atc-router"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_all" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + node_id     = (known after apply)
      + repository  = "atc-router"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "pre-commit"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1393928"
      ~ name        = "protect-main-branch-kong-build-images-pre-commit" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-development"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_all" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + node_id     = (known after apply)
      + repository  = "kong-development"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "pre-commit"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1393927"
      ~ name        = "protect-main-branch-kong-openssl-pre-commit" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-package"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_all" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + node_id     = (known after apply)
      + repository  = "kong-package"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "pre-commit"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_all["kong-runtime"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1393918"
      ~ name        = "protect-main-branch-kong-runtime-pre-commit" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["multi-arch-fpm"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_all" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + node_id     = (known after apply)
      + repository  = "multi-arch-fpm"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "pre-commit"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1393934"
      ~ name        = "protect-main-branch-template-1-github-release-pre-commit" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1393937"
      ~ name        = "protect-main-branch-template-1-terraform-pre-commit" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1393936"
      ~ name        = "protect-main-branch-template-template-pre-commit" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["terraform-github"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_all" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + node_id     = (known after apply)
      + repository  = "terraform-github"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "pre-commit"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-build-images"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1393924"
      ~ name        = "protect-main-branch-kong-build-images-release" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-development"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_kong" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + node_id     = (known after apply)
      + repository  = "kong-development"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "Done"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-openssl"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1393925"
      ~ name        = "protect-main-branch-kong-openssl-release" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-package"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_kong" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + node_id     = (known after apply)
      + repository  = "kong-package"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "Done"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-runtime"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1393916"
      ~ name        = "protect-main-branch-kong-runtime-release" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["multi-arch-fpm"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_kong" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + node_id     = (known after apply)
      + repository  = "multi-arch-fpm"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "Done"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
        id          = "1393933"
      ~ name        = "protect-main-branch-template-1-terraform-terraform-plan" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["terraform-github"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_terraform" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + node_id     = (known after apply)
      + repository  = "terraform-github"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "terraform"
                  + integration_id = 0
                }
            }
        }
    }

Plan: 9 to add, 10 to change, 4 to destroy.

<!-- Sticky Pull Request Commentterraform-plan -->